import 'dart:math';

class BarakhadiData {

  static const List<String> barakhadiList = [
    'क',
    'ख',
    'ग',
    'घ',
    'च',
    'छ',
    'ज',
    'झ',
    'त्र',
    'ट',
    'ठ',
    'ड',
    'ढ',
    'ण',
    'त',
    'थ',
    'द',
    'ध',
    'न',
    'प',
    'फ',
    'ब',
    'भ',
    'म',
    'य',
    'र',
    'ल',
    'व',
    'श',
    'ष',
    'स',
    'ह',
    'ळ',
    'क्ष',
    'ज्ञ',
  ];
  static List<List<String>> barakhadiTable = [
    ['अ', 'आ', 'इ', 'ई', 'उ', 'ऊ', 'ऋ', 'ए', 'ऐ', 'ओ', 'औ', 'अं', 'अः'],
    ['–', 'ा', 'ि', 'ी', 'ु', 'ू', 'ृृ', 'े', 'ै', 'ो', 'ौ', 'ं', 'ः'],
    ['क', 'का', 'कि', 'की', 'कु', 'कू', 'के', 'कै', 'को', 'कौ', 'कं', 'कः'],
    ['ख', 'खा', 'खि', 'खी', 'खु', 'खू', 'खे', 'खै', 'खो', 'खौ', 'खं', 'खः'],
    ['ग', 'गा', 'गि', 'गी', 'गु', 'गू', 'गे', 'गै', 'गो', 'गौ', 'गं', 'गः'],
    ['घ', 'घा', 'घि', 'घी', 'घु', 'घू', 'घे', 'घै', 'घो', 'घौ', 'घं', 'घः'],
    ['च', 'चा', 'चि', 'ची', 'चु', 'चू', 'चे', 'चै', 'चो', 'चौ', 'चं', 'चः'],
    ['छ', 'छा', 'छि', 'छी', 'छु', 'छू', 'छे', 'छै', 'छो', 'छौ', 'छं', 'छः'],
    ['ज', 'जा', 'जि', 'जी', 'जु', 'जू', 'जे', 'जै', 'जो', 'जौ', 'जं', 'जः'],
    ['झ', 'झा', 'झि', 'झी', 'झु', 'झू', 'झे', 'झै', 'झो', 'झौ', 'झं', 'झः'],
    ['ट', 'टा', 'टि', 'टी', 'टु', 'टू', 'टे', 'टै', 'टो', 'टौ', 'टं', 'टः'],
    ['ठ', 'ठा', 'ठि', 'ठी', 'ठु', 'ठू', 'ठे', 'ठै', 'ठो', 'ठौ', 'ठं', 'ठः'],
    ['ड', 'डा', 'डि', 'डी', 'डु', 'डू', 'डे', 'डै', 'डो', 'डौ', 'डं', 'डः'],
    ['ढ', 'ढा', 'ढि', 'ढी', 'ढु', 'ढू', 'ढे', 'ढै', 'ढो', 'ढौ', 'ढं', 'ढः'],
    ['ण', 'णा', 'णि', 'णी', 'णु', 'णू', 'णे', 'णै', 'णो', 'णौ', 'णं', 'णः'],
    ['त', 'ता', 'ति', 'ती', 'तु', 'तू', 'ते', 'तै', 'तो', 'तौ', 'तं', 'तः'],
    ['थ', 'था', 'थि', 'थी', 'थु', 'थू', 'थे', 'थै', 'थो', 'थौ', 'थं', 'थः'],
    ['द', 'दा', 'दि', 'दी', 'दु', 'दू', 'दे', 'दै', 'दो', 'दौ', 'दं', 'दः'],
    ['ध', 'धा', 'धि', 'धी', 'धु', 'धू', 'धे', 'धै', 'धो', 'धौ', 'धं', 'धः'],
    ['न', 'ना', 'नि', 'नी', 'नु', 'नू', 'ने', 'नै', 'नो', 'नौ', 'नं', 'नः'],
    ['प', 'पा', 'पि', 'पी', 'पु', 'पू', 'पे', 'पै', 'पो', 'पौ', 'पं', 'पः'],
    ['फ', 'फा', 'फि', 'फी', 'फु', 'फू', 'फे', 'फै', 'फो', 'फौ', 'फं', 'फः'],
    ['ब', 'बा', 'बि', 'बी', 'बु', 'बू', 'बे', 'बै', 'बो', 'बौ', 'बं', 'बः'],
    ['भ', 'भा', 'भि', 'भी', 'भु', 'भू', 'भे', 'भै', 'भो', 'भौ', 'भं', 'भः'],
    ['म', 'मा', 'मि', 'मी', 'मु', 'मू', 'मे', 'मै', 'मो', 'मौ', 'मं', 'मः'],
    ['य', 'या', 'यि', 'यी', 'यु', 'यू', 'ये', 'यै', 'यो', 'यौ', 'यं', 'यः'],
    ['र', 'रा', 'रि', 'री', 'रु', 'रू', 'रे', 'रै', 'रो', 'रौ', 'रं', 'रः'],
    ['ल', 'ला', 'लि', 'ली', 'लु', 'लू', 'ले', 'लै', 'लो', 'लौ', 'लं', 'लः'],
    ['ळ', 'ळा', 'ळि', 'ळी', 'ळु', 'ळू', 'ळे', 'ळै', 'ळो', 'ळौ', 'ळं', 'ळः'],
    ['व', 'वा', 'वि', 'वी', 'वु', 'वू', 'वे', 'वै', 'वो', 'वौ', 'वं', 'वः'],
    ['श', 'शा', 'शि', 'शी', 'शु', 'शू', 'शे', 'शै', 'शो', 'शौ', 'शं', 'शः'],
    ['स', 'सा', 'सि', 'सी', 'सु', 'सू', 'से', 'सै', 'सो', 'सौ', 'सं', 'सः'],
    ['ष', 'षा', 'षि', 'षी', 'षु', 'षू', 'षे', 'षै', 'षो', 'षौ', 'षं', 'षः'],
    ['ह', 'हा', 'हि', 'ही', 'हु', 'हू', 'हे', 'है', 'हो', 'हौ', 'हं', 'हः'],
    [
      'क्ष',
      'क्षा',
      'क्षि',
      'क्षी',
      'क्षु',
      'क्षू',
      'क्षे',
      'क्षै',
      'क्षो',
      'क्षौ',
      'क्षं',
      'क्षः'
    ],
    [
      'त्र',
      'त्रा',
      'त्रि',
      'त्री',
      'त्रु',
      'त्रू',
      'त्रे',
      'त्रै',
      'त्रो',
      'त्रौ',
      'त्रं',
      'त्रः'
    ],
    [
      'ज्ञ',
      'ज्ञा',
      'ज्ञि',
      'ज्ञी',
      'ज्ञु',
      'ज्ञू',
      'ज्ञे',
      'ज्ञै',
      'ज्ञो',
      'ज्ञौ',
      'ज्ञं',
      'ज्ञः'
    ],
    [
      'श्र',
      'श्रा',
      'श्रि',
      'श्री',
      'श्रु',
      'श्रू',
      'श्रे',
      'श्रै',
      'श्रो',
      'श्रौ',
      'श्रं',
      'श्रः'
    ],
  ];

  static String generateRandomBarakhadiFromBarakhadiTable() {
    final random = Random();
    final randomIndex = random.nextInt(barakhadiTable.length);
    final sublist = barakhadiTable[randomIndex];
    final randomSublistIndex = random.nextInt(sublist.length);
    final randomBarakhadi = sublist[randomSublistIndex];
    return randomBarakhadi;
  }

  static String generateRandomBarakhadiFromArray() {
    final random = Random();
    final randomIndex = random.nextInt(barakhadiList.length);
    final word = barakhadiList[randomIndex];
    return word;
  }
}
